package com.example.JuniTensho;

import static org.junit.jupiter.api.Assertions.assertArrayEquals;

import org.junit.jupiter.params.ParameterizedTest;
import org.junit.jupiter.params.provider.CsvSource;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.boot.test.context.SpringBootTest;

import com.example.JuniTensho.service.KanshiCalculator;

@SpringBootTest
class KanshiCalculatorTest {
    private final KanshiCalculator kanshiCalculator;

    @Autowired
    public KanshiCalculatorTest(KanshiCalculator kanshiCalculator){
        this.kanshiCalculator = kanshiCalculator;
    }

    @ParameterizedTest
    @CsvSource({
        "1987,2,4,'卯,子,甲申'","1987,2,18,'卯,子,戊戌'","1987,2,19,'卯,亥,己亥'","1987,3,20,'卯,亥,戊辰'","1987,3,21,'卯,戌,己巳'","1987,4,19,'卯,戌,戊戌'","1987,4,20,'卯,酉,己亥'","1987,5,20,'卯,酉,己巳'","1987,5,21,'卯,申,庚午'","1987,6,21,'卯,申,辛丑'","1987,6,22,'卯,未,壬寅'","1987,7,22,'卯,未,壬申'","1987,7,23,'卯,午,癸酉'","1987,8,23,'卯,午,甲辰'","1987,8,24,'卯,巳,乙巳'","1987,9,22,'卯,巳,甲戌'","1987,9,23,'卯,辰,乙亥'","1987,10,23,'卯,辰,乙巳'","1987,10,24,'卯,卯,丙午'","1987,11,22,'卯,卯,乙亥'","1987,11,23,'卯,寅,丙子'","1987,12,21,'卯,寅,甲辰'","1987,12,22,'卯,丑,乙巳'","1988,1,20,'卯,丑,甲戌'","1988,1,21,'卯,子,乙亥'","1988,2,3,'卯,子,戊子'",
        "1988,2,4,'辰,子,己丑'","1988,2,18,'辰,子,癸卯'","1988,2,19,'辰,亥,甲辰'","1988,3,19,'辰,亥,癸酉'","1988,3,20,'辰,戌,甲戌'","1988,4,19,'辰,戌,甲辰'","1988,4,20,'辰,酉,乙巳'","1988,5,20,'辰,酉,乙亥'","1988,5,21,'辰,申,丙子'","1988,6,20,'辰,申,丙午'","1988,6,21,'辰,未,丁未'","1988,7,21,'辰,未,丁丑'","1988,7,22,'辰,午,戊寅'","1988,8,22,'辰,午,己酉'","1988,8,23,'辰,巳,庚戌'","1988,9,22,'辰,巳,庚辰'","1988,9,23,'辰,辰,辛巳'","1988,10,22,'辰,辰,庚戌'","1988,10,23,'辰,卯,辛亥'","1988,11,21,'辰,卯,庚辰'","1988,11,22,'辰,寅,辛巳'","1988,12,21,'辰,寅,庚戌'","1988,12,22,'辰,丑,辛亥'","1989,1,19,'辰,丑,己卯'","1989,1,20,'辰,子,庚辰'","1989,2,3,'辰,子,甲午'",
        "1989,2,4,'巳,子,乙未'","1989,2,18,'巳,子,己酉'","1989,2,19,'巳,亥,庚戌'","1989,3,20,'巳,亥,己卯'","1989,3,21,'巳,戌,庚辰'","1989,4,19,'巳,戌,己酉'","1989,4,20,'巳,酉,庚戌'","1989,5,20,'巳,酉,庚辰'","1989,5,21,'巳,申,辛巳'","1989,6,20,'巳,申,辛亥'","1989,6,21,'巳,未,壬子'","1989,7,22,'巳,未,癸未'","1989,7,23,'巳,午,甲申'","1989,8,22,'巳,午,甲寅'","1989,8,23,'巳,巳,乙卯'","1989,9,22,'巳,巳,乙酉'","1989,9,23,'巳,辰,丙戌'","1989,10,22,'巳,辰,乙卯'","1989,10,23,'巳,卯,丙辰'","1989,11,21,'巳,卯,乙酉'","1989,11,22,'巳,寅,丙戌'","1989,12,21,'巳,寅,乙卯'","1989,12,22,'巳,丑,丙辰'","1990,1,19,'巳,丑,甲申'","1990,1,20,'巳,子,乙酉'","1990,2,3,'巳,子,己亥'",
        "1990,2,4,'午,子,庚子'","1990,2,18,'午,子,甲寅'","1990,2,19,'午,亥,乙卯'","1990,3,20,'午,亥,甲申'","1990,3,21,'午,戌,乙酉'","1990,4,19,'午,戌,甲寅'","1990,4,20,'午,酉,乙卯'","1990,5,20,'午,酉,乙酉'","1990,5,21,'午,申,丙戌'","1990,6,21,'午,申,丁巳'","1990,6,22,'午,未,戊午'","1990,7,22,'午,未,戊子'","1990,7,23,'午,午,己丑'","1990,8,22,'午,午,己未'","1990,8,23,'午,巳,庚申'","1990,9,22,'午,巳,庚寅'","1990,9,23,'午,辰,辛卯'","1990,10,23,'午,辰,辛酉'","1990,10,24,'午,卯,壬戌'","1990,11,21,'午,卯,庚寅'","1990,11,22,'午,寅,辛卯'","1990,12,21,'午,寅,庚申'","1990,12,22,'午,丑,辛酉'","1991,1,19,'午,丑,己丑'","1991,1,20,'午,子,庚寅'","1991,2,3,'午,子,甲辰'",
    })
    void 生年月日から干支を取得(int year,int month,int day,String expected){
        String[] result = kanshiCalculator.calculateKanshi(year, month, day);
        String[] expectedArray = expected.split(",");
        assertArrayEquals(expectedArray, result);
    }
}
